In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.0.3
1.24.3

In [22]:
n_rows = 5
n_cols = 5
cols = tuple( 'ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                  columns=cols)
df

    A   B   C   D   E
0   9  17  16   3  16
1   8  19   5   3  16
2  12  10  18   3   6
3  16   2  10   5  10
4   8   4   8  18  17

In [19]:
df .query( 'A > 5')

    A   B   C   D   E
0   6   8  14  18   4
1  17   8   8   2  10
2  16   9   7  17  18
3   7   8  11  18  13
4   9  17  12  11  14

In [23]:
rerata = df['A'].mean()
rerata

10.6

In [24]:
df.query('A>@rerata')

    A   B   C  D   E
2  12  10  18  3   6
3  16   2  10  5  10